# 班级里有学生：张三，李四，王五，赵六
x = ['张三', '李四', '王五', '赵六']
print(x)

# # 新来一个同学：马七
# x.append('马七')
# print(x)
# # 在列表末尾添加一个元素：append
# # 又新来两个同学：刘八，孙九
# x.extend(['刘八', '孙九'])
# print(x)
# # 在列表末尾添加一个列表：extend
# # 有一个同学插班进来的：袁十，位置安排在第2位
# x.insert(1, '袁十')
# print(x)
# # 在指定位置插入：变量名.insert(下标值, 插入的元素)
# # 张三要离开了
# x.remove('张三')
# print(x)
# # 按元素值删除：变量名.remove(删除元素的值)
# # 排序第2的人也要离开
# # 按元素位置删除：pop
# x.pop(1)
# print(x)
# # 排序第1的人改名：巴拉拉
# # 用下标给元素赋新的值
# x[0] = '巴拉拉'
# print(x)

# 每一次人员变化，都要打印出来
# print(要打印的内容)
